---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemHasTooManyBeams
source: html/c564c15e-7061-85ef-9dec-245f02adfe9d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemHasTooManyBeams Property

A beam system is trying to create more than 500 beams. Please use multiple beam systems if more than 500 beams are desired.

## Syntax (C#)
```csharp
public static FailureDefinitionId BeamSystemHasTooManyBeams { get; }
```